; domain
(define (domain cake1)
  (:requirements :strips :negative-preconditions)
  (:predicates
    (have ?c)
    (eaten ?c)
    (dirty)
  )
  (:action eat
      :parameters (?c)
      :precondition (have ?c)
      :effect (and
          (not (have ?c))
          (eaten ?c)
      )
  )
  (:action bake
      :parameters (?c)
      :precondition (and 
        (not (have ?c))
        (not (dirty))
      )
      :effect (and
        (have ?c)
        (dirty)
      )
  )

  (:action clean
      :parameters (?c)
      :precondition ()
      :effect (not (dirty))
  )
  
)

; problem
(define (problem have-cake-eat-cake)
  (:domain cake1)
  (:objects cake)
  (:init  )
  (:goal (and (have cake) (eaten cake)))
)

; plan
1. (bake cake)
   added: (have cake) (dirty)
   goals met: 1 of 2
2. (eat cake)
   deleted: (have cake)
   added: (eaten cake)
   goals met: 1 of 2
3. (clean cake)
   deleted: (dirty)
   goals met: 1 of 2
4. (bake cake)
   added: (have cake) (dirty)
   goals met: 2 of 2
